Repository: vyos-legacy/vyatta-strongswan
Catalog: debian/po/*.po
Languages: es, nb

source: Old runlevel management superseded
es: Se ha sustituido la antigua gestión del nivel de ejecución

source: Previous versions of the strongSwan package gave a choice between three different Start/Stop-Levels. Due to changes in the standard system startup procedure, this is no longer necessary or useful. For all new installations as well as old ones running in any of the predefined modes, sane default levels will now be set. If you are upgrading from a previous version and changed your strongSwan startup parameters, then please take a look at NEWS.Debian for instructions on how to modify your setup accordingly.
es: Las versiones previas del paquete de StrongSwan daban la opción de elegir entre tres niveles diferentes de Inicio/Parada. Debido a los cambios en el procedimiento del sistema estándar de arranque, esto ya no es necesario ni útil. Para todas las instalaciones nuevas, así como para las antiguas que ejecuten cualquiera de los modos predefinidos, se configurarán unos niveles predeterminado válidos. Si está actualizando de una versión antigua y ha cambiado los parámetros de arranque de StrongSwan, eche un vistazo al archivo «NEWS.Debian» para leer las instrucciones sobre cómo modificar su configuración apropiadamente.

source: Restart strongSwan now?
es: ¿Desea reiniciar StrongSwan ahora mismo?
nb: Start strongSwan på nytt nå

source: Restarting strongSwan is recommended, since if there is a security fix, it will not be applied until the daemon restarts. Most people expect the daemon to restart, so this is generally a good idea. However, this might take down existing connections and then bring them back up, so if you are using such a strongSwan tunnel to connect for this update, restarting is not recommended.
es: Se recomienda reiniciar StrongSwan, porque si hay un parche de seguridad, éste no se aplicará hasta que el demonio se reinicie. La mayoría de la gente espera que el demonio se reinicie, así que generalmente es una buena idea. Sin embargo, esto puede cerrar las conexiones existentes y después volverlas a abrir, de modo que si está utilizando un túnel de StrongSwan en la conexión de esta actualización, no se recomienda reiniciar.

source: Start strongSwan's IKEv1 daemon?
es: ¿Desea iniciar el demonio IKEv1 de StrongSwan?
nb: Skal strongSwans IKEv1-daemon startes?

source: The pluto daemon must be running to support version 1 of the Internet Key Exchange protocol.
es: El demonio pluto se debe ejecutar para poder utilizar la versión 1 del protocolo de intercambio de claves por internet («Internet Key Exchange»).
nb: Pluto-daemonen må kjøre for å kunne støtte versjon 1 av Internet Key Exchange-protokollen.

source: Start strongSwan's IKEv2 daemon?
es: ¿Desea iniciar el demonio IKEv2 de StrongSwan?
nb: Skal strongSwans IKEv2-daemon startes?

source: The charon daemon must be running to support version 2 of the Internet Key Exchange protocol.
es: El demonio charon se debe ejecutar para permitir utilizar la versión 2 del protocolo de intercambio de claves por internet («Internet Key Exchange»).
nb: Charon-daemonen må kjøre for å kunne støtte versjon 2 av Internet Key Exchange-protokollen.

source: Use an X.509 certificate for this host?
es: ¿Desea utilizar un certificado X.509 para esta máquina?

source: An X.509 certificate for this host can be automatically created or imported. It can be used to authenticate IPsec connections to other hosts and is the preferred way of building up secure IPsec connections. The other possibility would be to use shared secrets (passwords that are the same on both sides of the tunnel) for authenticating a connection, but for a larger number of connections, key based authentication is easier to administer and more secure.
es: Se puede crear automáticamente o importar un certificado X.509 para esta máquina. Esto se puede utilizar para autenticar conexiones IPsec de otras máquinas y es la forma preferida para construir conexiones IPsec seguras. La otra posibilidad sería utilizar secretos compartidos (contraseñas que son la misma en ambos lados del túnel) para autenticar una conexión, pero para un gran número de conexiones, la autenticación basada en claves es más sencilla de administrar y más segura.

source: Alternatively you can reject this option and later use the command "dpkg-reconfigure strongswan" to come back.
es: También puede rechazar esta opción y utilizar más tarde la orden «dpkg-reconfigure strongswan» para volver a este proceso.

source: create
es: crear

source: import
es: importar

source: Methods for using a X.509 certificate to authenticate this host:
es: Métodos para utilizar un certificado X.509 para autenticar esta máquina:

source: It is possible to create a new X.509 certificate with user-defined settings or to import an existing public and private key stored in PEM file(s) for authenticating IPsec connections.
es: Es posible crear un certificado X.509 nuevo con la configuración definida por el usuario o importar una clave pública/privada almacenada en archivo/s PEM para autenticar las conexiones IPsec.

source: If you choose to create a new X.509 certificate you will first be asked a number of questions which must be answered before the creation can start. Please keep in mind that if you want the public key to get signed by an existing Certificate Authority you should not select to create a self-signed certificate and all the answers given must match exactly the requirements of the CA, otherwise the certificate request may be rejected.
es: Si escoge crear un certificado X.509 nuevo, primero se le realizarán unas cuantas preguntas que deberá contestar antes de que la creación comience. Por favor, tenga en cuenta que si quiere que una Autoridad de Certificación (CA) firme la clave pública no debería escoger crear un certificado auto-firmado y todas las respuestas deberán coincidir exactamente con los requisitos de la CA, de otro modo puede que se rechace la petición del certificado.

source: If you want to import an existing public and private key you will be prompted for their filenames (which may be identical if both parts are stored together in one file). Optionally you may also specify a filename where the public key(s) of the Certificate Authority are kept, but this file cannot be the same as the former ones. Please also be aware that the format for the X.509 certificates has to be PEM and that the private key must not be encrypted or the import procedure will fail.
es: Si quiere importar una clave pública/privada, se le preguntará por los nombres de los archivos (que deberán ser idénticos si ambas partes se almacenan en un único archivo). Opcionalmente, puede indicar el nombre de un archivo dónde las clave/s pública/s de la Autoridad de Certificación se almacenen, pero este archivo no puede ser el mismo que los anteriores. Por favor, tenga en cuenta que el formato para los certificados X.509 tiene que ser PEM y que la clave privada no debe estar cifrada o el proceso de importación fallará.

source: File name of your PEM format X.509 certificate:
es: Nombre del archivo del certificado X.509 en el formato PEM:

source: Please enter the location of the file containing your X.509 certificate in PEM format.
es: Introduzca la ubicación completa del archivo que contiene el certificado X.509 en el formato PEM.

source: File name of your PEM format X.509 private key:
es: Nombre del archivo de la clave privada del certificado X.509 en el formato PEM:

source: Please enter the location of the file containing the private RSA key matching your X.509 certificate in PEM format. This can be the same file that contains the X.509 certificate.
es: Introduzca la ubicación del archivo que contiene la clave privada RSA del certificado X.509 en el formato PEM. Puede ser el mismo archivo que contiene el del certificado X.509.

source: File name of your PEM format X.509 RootCA:
es: Nombre del archivo del certificado X.509 de la raíz de la Autoridad de Certificación (CA) en el formato PEM:

source: Optionally you can now enter the location of the file containing the X.509 Certificate Authority root used to sign your certificate in PEM format. If you do not have one or do not want to use it please leave the field empty. Please note that it's not possible to store the RootCA in the same file as your X.509 certificate or private key.
es: Opcionalmente, ahora puede introducir la ubicación del archivo que contiene el certificado X.509 de la raíz de la Autoridad de Certificación (CA) utilizado para firmar su certificado en formato PEM. Si no tiene uno o no quiere utilizarlo, deje este campo en blanco. Por favor, tenga en cuenta que no es posible almacenar la raíz de la CA en el mismo archivo que su certificado X.509 o la clave privada.

source: Please enter which length the created RSA key should have:
es: Introduzca la longitud que debería tener la clave RSA creada:

source: Please enter the length of the created RSA key. It should not be less than 1024 bits because this should be considered unsecure and you will probably not need anything more than 4096 bits because it only slows the authentication process down and is not needed at the moment.
es: Introduzca la longitud de la clave RSA creada. No debería ser menor de 1024 bits porque se considera inseguro, además probablemente no necesite más de 4096 bits porque sólo ralentiza el proceso de autenticación y no es necesario en estos momentos.

source: Create a self-signed X.509 certificate?
es: ¿Desea crear un certificado X.509 auto-firmado?
nb: Skal det lages et selvsignert X.509-sertifikat?

source: Only self-signed X.509 certificates can be created automatically, because otherwise a Certificate Authority is needed to sign the certificate request. If you choose to create a self-signed certificate, you can use it immediately to connect to other IPsec hosts that support X.509 certificate for authentication of IPsec connections. However, using strongSwan's PKI features requires all certificates to be signed by a single Certificate Authority to create a trust path.
es: Sólo los certificados X.509 se pueden crear automáticamente, porque de otro modo la Autoridad de Certificación (CA) se necesitará para firmar la petición del certificado. Si escoge crear un certificado auto-firmado, puede utilizarlo inmediatamente para conectar a otras máquinas IPsec que permitan la autenticación de conexiones IPsec con certificados X.509. Sin embargo, si se utilizan las funcionalidades PKI de StrongSwan se necesita que todos los certificados estén firmados por una única Autoridad de Certificación para crear una ruta segura.

source: If you do not choose to create a self-signed certificate, only the RSA private key and the certificate request will be created, and you will have to sign the certificate request with your Certificate Authority.
es: Si no escoge crear un certificado auto-firmado, sólo se crearán las peticiones de la clave privada y la petición del certificado, y tendrá que firmar la petición del certificado con su Autoridad de Certificación.

source: Country code for the X.509 certificate request:
es: Código del país para la petición del certificado X.509:
nb: Landskode for X.509-sertifikatsøknaden:

source: Please enter the two-letter code for the country the server resides in (such as "AT" for Austria).
es: Introduzca el código de dos letras para el país en el que el servidor está ubicado (por ejemplo «ES» para España).

source: OpenSSL will refuse to generate a certificate unless this is a valid ISO-3166 country code; an empty field is allowed elsewhere in the X.509 certificate, but not here.
es: OpenSSL rechazará generar un certificado a menos que este campo sea un código de país ISO-3166 válido, además no se permite que este campo se deje en blanco.

source: State or province name for the X.509 certificate request:
es: Estado o provincia para la petición del certificado X.509:
nb: Stat eller provinsnavn for X.509-sertifikatsøknaden:

source: Please enter the full name of the state or province the server resides in (such as "Upper Austria").
es: Introduzca el nombre completo del estado o la provincia en la que el servidor está ubicado (por ejemplo «Comunidad de Madrid»).

source: Locality name for the X.509 certificate request:
es: Localidad para la petición del certificado X.509:
nb: Stedsnavn for X.509-sertifikatsøknaden:

source: Please enter the locality the server resides in (often a city, such as "Vienna").
es: Introduzca la localidad en la que el servidor está ubicado (normalmente una ciudad, por ejemplo «Madrid»).

source: Organization name for the X.509 certificate request:
es: Nombre de la organización para la petición del certificado X.509:
nb: Organisasjonsnavn for X.509-sertifikatsøknaden:

source: Please enter the organization the server belongs to (such as "Debian").
es: Introduzca la organización a la que el servidor pertenece (por ejemplo «Debian»).

source: Organizational unit for the X.509 certificate request:
es: Unidad de la organización para la petición del certificado X.509:
nb: Organisasjonsenhet for X.509-sertifikatsøknaden:

source: Please enter the organizational unit the server belongs to (such as "security group").
es: Introduzca el nombre de la unidad de la organización (o departamento) a la que el servidor pertenece (por ejemplo «departamento de seguridad»).

source: Common Name for the X.509 certificate request:
es: Nombre Común (CN) para la petición del certificado X.509:

source: Please enter the Common Name for this host (such as "gateway.example.org").
es: Introduzca el Nombre Común (CN) de esta máquina (por ejemplo «gateway.example.org»).

source: Email address for the X.509 certificate request:
es: Dirección de correo electrónico para la petición del certificado X.509:
nb: E-postadresse for X.509-sertifikatsøknaden:

source: Please enter the email address of the person or organization responsible for the X.509 certificate.
es: Introduzca la dirección de correo electrónico del responsable individual o de la organización del certificado X.509.

source: Enable opportunistic encryption?
es: ¿Desea activar el cifrado oportunístico?
nb: Slå på opportunistisk kryptering?

source: This version of strongSwan supports opportunistic encryption (OE), which stores IPSec authentication information in DNS records. Until this is widely deployed, activating it will cause a significant delay for every new outgoing connection.
es: Esta versión de StrongSwan permite utilizar cifrado oportunístico («Opportunistic Encryption», OE), que almacena la información de la autenticación de IPSec en los registros del DNS. Hasta que esto esté ampliamente difundido, activarlo puede causar un gran retraso para cada conexión saliente.
nb: Denne versjonen av strongSwan støtter opportunistisk kryptering (OE), som lagrer autentiseringsinformasjon for IPSec i DNS-data. Inntil dette er tatt i vanlig bruk vil det gi en betydelig forsinkelse for hver ny utgående tilkobling hvis dette er aktivert.

source: You should only enable opportunistic encryption if you are sure you want it. It may break the Internet connection (default route) as the pluto daemon starts.
es: Sólo debería activar el cifrado oportunístico si está seguro que lo quiere. Esto puede romper la conexión a internet (la ruta predeterminada) cuando el demonio pluto se inicie.
nb: Du bør bare slå på opportunistisk kryptering hvis du er sikker på at du vil ha det. Det kan koble ut Internett-forbindelsen (standardruten) når pluto.nissen starter.

source: earliest
nb: tidligst

source: after NFS
nb: etter NFS

source: after PCMCIA
nb: etter PCMCIA

source: When to start strongSwan:
nb: Når strongSwan skal startes:

source: StrongSwan starts during system startup so that it can protect filesystems that are automatically mounted.
nb: StrongSwan starter under systemoppstart, slik at det kan beskytte filsystemer som monteres automatisk.

source: * earliest: if /usr is not mounted through NFS and you don't use a PCMCIA network card, it is best to start strongSwan as soon as possible, so that NFS mounts can be secured by IPSec; * after NFS: recommended when /usr is mounted through NFS and no PCMCIA network card is used; * after PCMCIA: recommended if the IPSec connection uses a PCMCIA network card or if it needs keys to be fetched from a locally running DNS server with DNSSec support.
nb: * tidligst: hvis /usr ikke monteres via NFS og du ikke bruker et PCMCIA nettverkskort, så er det best å starte strongSwan snarest mulig, slik at NFS-montering kan sikres med IPSec; * etter NFS: anbefales når /usr monteres via NFS og det ikke brukes noe PCMCIA nettverkskort. * etter PCMCIA: anbefales hvis IPSec-tilkoblingen bruker et PCMCIA nettverkskort eller om den trenger å hente nøkler fra en lokal DNS-tjener med DNSSec-støtte.

source: Restarting strongSwan is recommended, because if there is a security fix, it will not be applied until the daemon restarts. However, this might close existing connections and then bring them back up.
nb: Det anbefales å starte strongSwan på nytt nå, for om det var en sikkerhetsrettelse, så får den ikke effekt før daemonen startes på nytt. Imidlertid kan dette lukke eksisterende forbindelser og deretter koble dem opp igjen.

source: If you don't restart strongSwan now, you should do so manually at the first opportunity.
nb: Hvis du ikke gjør en omstart på strongSwan nå, så bør du gjøre det manuelt ved første anledning.

source: Create an RSA public/private keypair for this host?
nb: Skal det lages et offentlig/privat RSA-nøkkelpar for denne verten?

source: StrongSwan can use a Pre-Shared Key (PSK) or an RSA keypair to authenticate IPSec connections to other hosts. RSA authentication is generally considered more secure and is easier to administer. You can use PSK and RSA authentication simultaneously.
nb: StrongSwan kan bruke en delt nøkkel (PSK) eller et RSA-nøkkelpar for å autentisere IPSec-forbindelser til andre verter. RSA-autentisering betraktes for det meste som sikrere og lettere å administrere. Du kan bruke PSK og RSA-autentisering samtidig.

source: If you do not want to create a new public/private keypair, you can choose to use an existing one in the next step.
nb: Hvis du ikke vil lage et nytt offentlig/privat nøkkelpar, så kan du velge å bruke et eksisterende nøkkelpar i neste steg.

source: Use an existing X.509 certificate for strongSwan?
nb: Skal et eksisterende X.509-sertifikat brukes for strongSwan?

source: The required information can automatically be extracted from an existing X.509 certificate with a matching RSA private key. Both parts can be in one file, if it is in PEM format. You should choose this option if you have such an existing certificate and key file and want to use it for authenticating IPSec connections.
nb: Den informasjonen som trengs kan hentes automatisk fra et eksisterende X.509-sertifikat med tilhørende privat RSA-nøkkel. Begge deler kan være i én fil, hvis den er i PEM-format. Du bør velge dette hvis du har et slikt sertifikat og vil bruke det til å autentisere IPSec-forbindelser.

source: File name of your X.509 certificate in PEM format:
nb: Filnavn for ditt X.509-sertifikat i PEM-format:

source: Please enter the full location of the file containing your X.509 certificate in PEM format.
nb: Oppgi full sti til fila som inneholder ditt X.509-sertifikat i PEM-format.

source: File name of your existing X.509 private key in PEM format:
nb: Filnavn for din eksisterende private X.509-nøkkel i PEM-format:

source: Please enter the full location of the file containing the private RSA key matching your X.509 certificate in PEM format. This can be the same file as the X.509 certificate.
nb: Oppgi full sti til fila som inneholder den private nøkkelen som tilsvarer ditt X.509-sertifikat i PEM-format. Dette kan være den samme fila som X.509-sertifikatet.

source: RSA key length:
nb: RSA nøkkellengde:

source: Please enter the length of RSA key you wish to generate. A value of less than 1024 bits is not considered secure. A value of more than 2048 bits will probably affect performance.
nb: Oppgi lengde for RSA-nøkkelen du vil opprette. Kortere nøkler enn 1024 bit betraktes ikke som sikre. En nøkkellengde på mer enn 2048 bit vil antakelig gå ut over ytelsen.

source: Only self-signed X.509 certificates can be created automatically, because otherwise a certificate authority is needed to sign the certificate request.
nb: Bare selvsignerte X.509-sertifikater kan lages automatisk, for ellers må en sertifikatutsteder signere sertifikatsøknaden.

source: If you accept this option, the certificate created can be used immediately to connect to other IPSec hosts that support authentication via an X.509 certificate. However, using strongSwan's PKI features requires a trust path to be created by having all X.509 certificates signed by a single authority.
nb: Hvis du godtar dette, så kan det sertifikatet som lages bli brukt straks til å kople til andre IPSec-verter som støtter autentisering via et X.509-sertifikat. Men om strongSwans PKI-del skal brukes, må det lages en tillitskjede ved at alle X.509-sertifikatene signeres av en enkelt utsteder.

source: If you do not accept this option, only the RSA private key will be created, along with a certificate request which you will need to have signed by a certificate authority.
nb: Hvis du ikke godtar dette, så blir bare en privat RSA-nøkkel opprettet, sammen med en sertifikatsøknad som du må få en sertifikatutsteder til å signere.

source: Please enter the two-letter ISO3166 country code that should be used in the certificate request.
nb: Oppgi tobokstavers ISO3166 landskode som skal brukes i sertifikatsøknaden.

source: This field is mandatory; otherwise a certificate cannot be generated.
nb: Dette feltet er obligatorisk, uten det kan det ikke lages et sertifikat.

source: Please enter the full name of the state or province to include in the certificate request.
nb: Oppgi fullt navn på stat eller provins som skal tas med i sertifikatsøknaden.

source: Please enter the locality name (often a city) that should be used in the certificate request.
nb: Oppgi stedsnavn (ofte en by) som skal brukes i sertifikatsøknaden.

source: Please enter the organization name (often a company) that should be used in the certificate request.
nb: Oppgi organisasjonsnavn (ofte et firma) som skal brukes i sertifikatsøknaden.

source: Please enter the organizational unit name (often a department) that should be used in the certificate request.
nb: Oppgi organisasjonsenhet (ofte en avdeling som skal brukes i sertifikatsøknaden.

source: Common name for the X.509 certificate request:
nb: Vanlig navn for X.509-sertifikatsøknaden:

source: Please enter the common name (such as the host name of this machine) that should be used in the certificate request.
nb: Oppgi vanlig navn (slik som vertsnavnet på denne maskinen) som skal brukes i sertifikatsøknaden.

source: Please enter the email address (for the individual or organization responsible) that should be used in the certificate request.
nb: Oppgi e-postadressen (for ansvarlig person eller organisasjon) som skal brukes i sertifikatsøknaden.
